# common_utils.py

from aiogram.fsm.state import State, StatesGroup
from aiogram import types

# --- Константы для выбора регионов ---
TAJIKISTAN_LOCATIONS = {
    "РРП (Душанбе)": ["Душанбе", "Гиссар", "Вахдат", "Турсунзаде (Регар)", "Нурек", "Варзобский район", "Лахшский район", "Нурабадский район",
                      "Раштский район", "Рогунский район", "Район Рудаки", "Район Сангвор", "Таджикабадский район", "Файзабадский район", "Шахринавский район"],
    "Согдийская область": ["Худжанд", "Бустон (Чкаловск)", "Гулистон (Кайраккум)", "Истиклол", "Канибадам", "Исфара", "Истаравшан", "Пенджикент",
                           "Айнинский район", "Аштский район", "Гафуровский район", "Район Деваштич (Гончи)", "Горно-Матчинский район", "Джаббар-Расуловский район",
                           "Зафарабадский район", "Новый-Матчинский район", "Спитаменский район (Нов)", "Шахристанский район"],
    "Хатлонская область": ["Бохтар (Курган-тюбе)", "Куляб", "Нурек", "Левакант", "Район Абдурахмана Джами", "Бальджуванский район", "Вахшский район", "Восейский район",
                           "Дангаринский район", "Район Джайхун", "Район Джалолиддин Балхи", "Район Дусти", "Кубодиёнский район", "Район Кушониён",
                           "Муминабадский район", "Район Носири-Хусравский",
                           "Фархарский район", "Пянджский район", "Темурмаликский район", "Район Хамадони (Московский)", "Ховалингский район", "Хуросонский район",
                           "Район Шамсиддин Шохин", "Шахритусский район", "Яванский район"],
    "ГБАО (Памир)": ["Хорог", "Ванчский район", "Дарвазский район", "Ишкашимский район", "Мургабский район", "Рошткалинский район", "Рушанский район", "Шугнанский район"],
}

# --- Константы для выбора параметров жилья ---
HOUSE_TYPES = ["Квартира", "Дом", "Комната"]
ROOM_OPTIONS = ["1", "2", "3", "4", "5", "Больше 5"]
RENOVATION_OPTIONS = ["Евроремонт", "Советский", "Косметический", "Без ремонта"]

# --- Класс состояний для ДОБАВЛЕНИЯ объявления (Form) ---
class Form(StatesGroup):
    location = State()
    price = State()
    description = State()
    tel = State()
    photos = State()
    owner = State()
    type_property = State()
    rooms = State()
    floor_info = State()
    renovation = State()

# --- Класс состояний для ПОИСКА/ФИЛЬТРАЦИИ объявлений (FilterForm) ---
class FilterForm(StatesGroup):
    choosing_location = State()
    choosing_type = State()
    choosing_rooms = State()
    viewing_apartments = State()

# --- Общая функция утилиты для создания Inline-клавиатур ---
def create_inline_keyboard(options, callback_prefix):
    """Создает InlineKeyboardMarkup из списка опций."""
    keyboard_buttons = [
        [types.InlineKeyboardButton(text=opt, callback_data=f"{callback_prefix}_{opt}")]
        for opt in options
    ]
    return types.InlineKeyboardMarkup(inline_keyboard=keyboard_buttons)
