TAJIKISTAN_LOCATIONS = {
    "РРП (Душанбе)": ["Душанбе", "Гиссар", "Вахдат", "Турсунзаде (Регар)", "Нурек", "Варзобский район", "Лахшский район", "Нурабадский район",
                      "Раштский район", "Рогунский район", "Район Рудаки", "Район Сангвор", "Таджикабадский район", "Файзабадский район", "Шахринавский район"],
    "Согдийская область": ["Худжанд", "Бустон (Чкаловск)", "Гулистон (Кайраккум)", "Истиклол", "Канибадам", "Исфара", "Истаравшан", "Пенджикент",
                           "Айнинский район", "Аштский район", "Гафуровский район", "Район Деваштич (Гончи)", "Горно-Матчинский район", "Джаббар-Расуловский район",
                           "Зафарабадский район", "Новый-Матчинский район", "Спитаменский район (Нов)", "Шахристанский район"],
    "Хатлонская область": ["Бохтар (Курган-тюбе)", "Куляб", "Нурек", "Левакант", "Район Абдурахмана Джами", "Бальджуванский район", "Вахшский район", "Восейский район",
                           "Дангаринский район", "Район Джайхун", "Район Джалолиддин Балхи", "Район Дусти", "Кубодиёнский район", "Район Кушониён",
                           "Муминабадский район", "Район Носири-Хусравский",
                           "Фархарский район", "Пянджский район", "Темурмаликский район", "Район Хамадони (Московский)", "Ховалингский район", "Хуросонский район",
                           "Район Шамсиддин Шохин", "Шахритусский район", "Яванский район"],
    "ГБАО (Памир)": ["Хорог", "Ванчский район", "Дарвазский район", "Ишкашимский район", "Мургабский район", "Рошткалинский район", "Рушанский район", "Шугнанский район"],
}